backend/app/controllers/games_controller.rb

    def create
        game = Game.create(user_id: params[:user_id], score: 0)
---
INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", "1"], ["created_at", "2020-12-24 17:20:42.104289"], ["updated_at", "2020-12-24 17:20:42.104289"]]