backend/app/controllers/users_controller.rb

    def show
        user = User.find_by(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]

    def create
        user = User.new()
        user.username = params[:user][:username]
        user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "test9"], ["created_at", "2020-12-24 02:02:03.722934"], ["updated_at", "2020-12-24 02:02:03.722934"]]